{"meta":{"title":"개발새발 블로그","subtitle":"개발새발 블로그","description":null,"author":"Hyunkyung Ahn","url":"https://tuwhit.github.io"},"pages":[],"posts":[{"title":"UI와 UX에 대한 개념 정리","slug":"til","date":"2017-09-26T13:48:04.000Z","updated":"2017-09-26T15:03:21.000Z","comments":true,"path":"2017/09/26/til/","link":"","permalink":"https://tuwhit.github.io/2017/09/26/til/","excerpt":"","text":"프로젝트 진행중에 UX 설계를 해볼일이 생겼는데, 디알못이라 뭘 어떻게 해야할지 영 감이 잘 안잡혀서 일단 UI, UX의 개념이라도 정리해봤다.(정리하다보니 생각났는데 옛날에 Human Centered Design 스터디를 한적이 있는데, 그것도 UX Design에 속하는 거였나 싶음) UI(User Interface) 일련의 화면, 페이지 및 장치와 상호작용할 때 사용하는 시각적 요소 UX(User Experience) 회사, 서비스 및 제품과 상호 작용하는 사용자의 경험 UX Design 실제 필드에서 사용자를 관찰하고, 그 결과를 바탕으로 디자인 누가, 왜, 무엇을, 어떻게 사용하는지를 고려해야함 어떤 목적인지, 어떤 의도가 있는지, 어떻게 쓰였으면 좋겠는지에 대해 고민 필요 UI와 UX의 차이점(에 대한 전문가들의 생각) UX는 문제를 해결하기위한 사용자의 여정에 포커스를 두고 UI는 제품 표면의 모습과 기능에 초점을 맞춘다. - Ken Norton UX 디자이너는 디자인 프로세스의 개념적 측면에 관심을 가지기 때문에 UI 디자이너는 보다 확실한 요소에 집중할 수 있다. - Andy Budd UX와 UI 디자인은 서로 비교할 수 없는 두가지이므로 차이가 없다. -Craig Morrision UI는 일반적으로 화면 주변의 시각적 디자인 및 정보 디자인에 관한것이다. UX는 완벽한 경험에 관한 것이므로 화면과 관련이 없을 수 있다. - Patrick Neema UI는 제품에 중점을 두고 있으며 일련의 스냅샷을 제시간에 제공한다. UX는 사용자 및 제품을 통한 이동에 초점을 맞춘다. - Scott Jenson UX는 사용자가 제품을 사용하여 얻은 전반적인 경험이며 UI는 사용자가 실제로 상호 작용하고 볼수있는 것이다. - Clayton Yan API 로직을 고려하면서 UX 설계를 하려니 쉬운일이 아닌것같다. UX를 우선으로 하자니 로직 개선하기가 빡세고, 쉽게 가자니 UX가 좋지 않은것 같고… 엉엉","categories":[],"tags":[{"name":"UI","slug":"UI","permalink":"https://tuwhit.github.io/tags/UI/"},{"name":"UX","slug":"UX","permalink":"https://tuwhit.github.io/tags/UX/"},{"name":"Design","slug":"Design","permalink":"https://tuwhit.github.io/tags/Design/"}]},{"title":"블로그 개설","slug":"first-post","date":"2017-09-24T12:00:45.000Z","updated":"2017-09-26T12:21:32.000Z","comments":true,"path":"2017/09/24/first-post/","link":"","permalink":"https://tuwhit.github.io/2017/09/24/first-post/","excerpt":"","text":"Github Pages, Hexo 로 블로그 개설! Jekyll을 이용해서 만들까 하다가 Ruby는 회사에서 많이 쓰니 Node.js 기반인 Hexo로 선택했다. 근데 뭐 Node.js 까막눈이어도 눈칫껏 만져보니 기존 테마에 살짝 커스텀하는 정도는 금방 하는듯. Markdown 문법도 잘 몰라서 Markdown 작성법 보면서 이래저래 써보는 중인데 꽤 재밌다. 블로그 메뉴를 어떻게 나눌지, footer 엔 어떤 위젯을 넣을지, 로고는 뭘로 할지 고민. 10대때 열심히 네이버 블로그 꾸미던 시절 생각난다. 하악하악 재밌어! Daily 테마 위키에 comment field 추가하려면 _config.yml 파일에disqus_shortname: your-disqus-shortname 만 추가해주면 된다고 했는데 코멘트 영역이 안뜸…^ㅅㅠ 다행히 disqus 홈페이지에 들어가보니 site - installation 메뉴에 코드가 제공돼있었다.1234567891011121314151617181920&lt;div id=\"disqus_thread\"&gt;&lt;/div&gt;&lt;script&gt;/*** RECOMMENDED CONFIGURATION VARIABLES: EDIT AND UNCOMMENT THE SECTION BELOW TO INSERT DYNAMIC VALUES FROM YOUR PLATFORM OR CMS.* LEARN WHY DEFINING THESE VARIABLES IS IMPORTANT: https://disqus.com/admin/universalcode/#configuration-variables*//*var disqus_config = function () &#123;this.page.url = PAGE_URL; // Replace PAGE_URL with your page's canonical URL variablethis.page.identifier = PAGE_IDENTIFIER; // Replace PAGE_IDENTIFIER with your page's unique identifier variable&#125;;*/(function() &#123; // DON'T EDIT BELOW THIS LINEvar d = document, s = d.createElement('script');s.src = 'https://tuwhit.disqus.com/embed.js';s.setAttribute('data-timestamp', +new Date());(d.head || d.body).appendChild(s);&#125;)();&lt;/script&gt;&lt;noscript&gt;Please enable JavaScript to view the &lt;a href=\"https://disqus.com/?ref_noscript\"&gt;comments powered by Disqus.&lt;/a&gt;&lt;/noscript&gt; Disqus가 들어갈 부분에 위 코드를 넣으니 해결! 테마 적용후 deploy 했는데 반영되는데 시간이 꽤 걸리나보다. 계속 깨져보이길래 제대로 deploy 안된줄알고 구글링중이었는데, 몇분 지나니까 잘 반영돼 있음.","categories":[],"tags":[{"name":"blog","slug":"blog","permalink":"https://tuwhit.github.io/tags/blog/"},{"name":"github","slug":"github","permalink":"https://tuwhit.github.io/tags/github/"},{"name":"hexo","slug":"hexo","permalink":"https://tuwhit.github.io/tags/hexo/"}]}]}